/*
 * Напиши скрипт обробки покупки в магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сумма покупки зберігається в змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
 * доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з балансу суму покупки
 *    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */
// 'Все добре, знімаємо гроші... Дякуємо за покупку!'



// let balance = 30000;
// const payment = 20000;
// const message = `Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість 
// доступних коштів на рахунку`;
// alert(message);

// if (payment <= balance) {
//     balance -= payment;
//     alert('Все добре, знімаємо гроші... Дякуємо за покупку!')
//     alert(`На рахунку залишилося ${balance} кредитів`);
// } else {
//     alert('На рахунку недостатньо коштів для проведення операції!');
// }
// alert('Операція завершена');



/*
 * Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 * * - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */


// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'



// const totalSpent = 2000;
// let payment = 500;
// let discount = 0;

// if (totalSpent >= 100 && totalSpent < 1000) {
//     discount = 0.02;
//     console.log(`Бронзовий партнер, знижка ${discount * 100}%`);
// } else if (totalSpent >= 1000 && totalSpent < 5000) {
//     discount = 0.05;
//     console.log(`Срібний партнер, знижка ${discount * 100}%`);
// } else if (totalSpent >= 5000) {
//     discount = 0.1;
//     console.log(`Золотий партнер, знижка ${discount * 100}%`);
// } else if (totalSpent < 100) {
//     discount = 0;
//     console.log(`У вас ще немає партнерської знижки`);
// }

// alert(`Оформляемо замовлення на суму ${payment} зі знижкою ${discount * 100} %`);
// alert(`Фінальна ціна - ${payment - payment * discount}`);




// const clients = ['Mango', 'Poly', 'Alex'];

// for (let i = 0; clients.length > i; i += 1) {
//     console.log(clients[i]);
// }


const clients = ["Mango", "Ajax", "Poly"];

for (const client of clients) {
  console.log(client);
}

const string = "javascript";

for (const character of string) {
  console.log(character);
}